app/controllers/alerts_controller.rb

SELECT "alerts".* FROM "alerts" WHERE ("alerts"."id" = 1) LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".alert_id = 1) ORDER BY created_at DESC
---
  def show
    @alert = Alert.find(params[:id])
    @comentarios = @alert.comments.find(:all, :order => 'created_at DESC').paginate(:per_page => 3, :page => params[:page])

INSERT INTO "alerts" ("created_at", "content", "updated_at", "lugar") VALUES ('2011-12-24 19:31:54.519289', 'Accidente de Trafico, a un automovil le cayo encima la tranca XD', '2011-12-24 19:31:54.519289', 'UNITEC')
SELECT "alerts".* FROM "alerts" ORDER BY created_at DESC
---
  def create
  @alert = Alert.new params[:alert]
  if @alert.save
  redirect_to new_alert_path
  else
  @alertas= Alert.all.reverse!

SELECT "alerts".* FROM "alerts" ORDER BY created_at DESC
---
  def new
  @alert = Alert.new
  @alertas= Alert.all.reverse!